"""
Задача 3
Отсортируйте словарь по значению в порядке возрастания и убывания.

Задача 4
Напишите программу для слияния нескольких словарей в один.

Задача 5
Найдите три ключа с самыми высокими значениями в словаре my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}.

Задача 6
Напишите код, который переводит целое число в строку, при том что его можно применить в любой системе счисления.

Задача 7
Нужно вывести первые n строк треугольника Паскаля. В этом треугольнике на вершине и по бокам стоят единицы, а каждое число внутри равно сумме двух расположенных над ним чисел.

Задача 8
Напишите проверку на то, является ли строка палиндромом. Палиндром — это слово или фраза, которые одинаково читаются слева направо и справа налево.

Задача 9
Сделайте так, чтобы число секунд отображалось в виде дни:часы:минуты:секунды.

Задача 10
Вы принимаете от пользователя последовательность чисел, разделённых запятой. Составьте список и кортеж с этими числами.

Задача 11
Выведите первый и последний элемент списка.

Вариант решения
Задача 12
Напишите программу, которая принимает имя файла и выводит его расширение. Если расширение у файла определить невозможно, выбросите исключение.

Вариант решения
Задача 13
При заданном целом числе n посчитайте n + nn + nnn.

Вариант решения
Задача 14
Напишите программу, которая выводит чётные числа из заданного списка и останавливается, если встречает число 237.

Вариант решения
Задача 15
Напишите программу, которая принимает два списка и выводит все элементы первого, которых нет во втором.

Вариант решения
Задача 16
Выведите список файлов в указанной директории.

Вариант решения
Задача 17
Сложите цифры целого числа.

Вариант решения
Задача 18
Посчитайте, сколько раз символ встречается в строке.

Вариант решения
Задача 19
Поменяйте значения переменных местами.

Вариант решения


Задача 20
С помощью анонимной функции извлеките из списка числа, делимые на 15.

Вариант решения
Задача 21
Нужно проверить, все ли числа в последовательности уникальны.

Вариант решения
Задача 22
Напишите программу, которая принимает текст и выводит два слова: наиболее часто встречающееся и самое длинное.

Вариант решения
"""
import operator

a = {"1":2, "2":10, "3":7, "4":5}

print(dict(sorted(a.items(), key=lambda a: a[1])))


